[
  {
    "title": "Listă de activități construită folosind React.js",
    "image": "/images/projects/todo-react/og-image.png",
    "date": "August 2021",
    "link": "https://nifty-shannon-f6a04e.netlify.app",
    "slug": "todo-react",
    "github": "https://github.com/lucianm05/todo-app-reactjs",
    "content": "Aplicația constă într-o simplă listă de activități construită folosind React.js.\nUtilizatorii pot adăuga o activitate, o pot marca drept terminată sau în progres în caz că își aduc aminte că a rămas ceva de făcut, sau o pot șterge definitiv.\nActivitățile sunt salvate în memoria locală, nu sunt pierdute când utilizatorul închide pagina.\nTech stack: HTML, SCSS, React.js, Redux."
  },
  {
    "title": "Listă de activități construită folosind TypeScript, urmând abordarea POO",
    "image": "/images/projects/todo-oop-ts/og-image.png",
    "date": "August 2021",
    "link": "https://lucianm05.github.io/todo-app-oop-ts/",
    "slug": "todo-oop-ts",
    "github": "https://github.com/lucianm05/todo-app-oop-ts",
    "content": "Aplicația constă într-o simplă listă de activități construită folosind Typescript, urmând abordarea POO.\nUtilizatorii pot adăuga o activitate, o pot marca drept terminată sau în progres în caz că își aduc aminte că a rămas ceva de făcut, sau o pot șterge definitiv.\nActivitățile sunt salvate în memoria locală, nu sunt pierdute când utilizatorul închide pagina.\nTech stack: HTML, SCSS, TypeScript."
  },
  {
    "title": "Listă de activități construită folosind TypeScript, urmând abordarea procedurală",
    "image": "/images/projects/todo-procedural-ts/og-image.png",
    "date": "August 2021",
    "link": "https://lucianm05.github.io/todo-app-procedural-ts/",
    "slug": "todo-procedural-ts",
    "github": "https://github.com/lucianm05/todo-app-procedural-ts",
    "content": "Aplicația constă într-o simplă listă de activități construită folosind Typescript, urmând abordarea procedurală.\nUtilizatorii pot adăuga o activitate, o pot marca drept terminată sau în progres în caz că își aduc aminte că a rămas ceva de făcut, sau o pot șterge definitiv.\nActivitățile sunt salvate în memoria locală, nu sunt pierdute când utilizatorul închide pagina.\nTech stack: HTML, SCSS, TypeScript."
  },
  {
    "title": "Pagină principală Elefant.ro făcută în Next.js",
    "image": "/images/projects/elefant-copy/og-image.png",
    "date": "Iulie 2021",
    "link": "https://copie-elefant-ro-next-js.vercel.app",
    "slug": "elefant-copy",
    "github": "https://github.com/lucianm05/copie-elefant.ro-nextJS",
    "content": "Aplicația reprezintă o imitație a paginii principale de pe elefant.ro. Tot ce ține de design le aparține celor de la elefant, în afară de diferitele iconuri care provin din surse diferite, menționate într-un fișier care se poate găsi în codul sursă.\nAm considerat că este un exercițiu bun pentru a învăța mai bine să lucrez cu NextJS și pentru a-mi dezvolta capabilitățile de fullstack, în special pe cele de frontend.\nPrincipalele cunoștiințe desprinse în urma dezvoltării acestei aplicații sunt:\n* accesibilitate \n* viteza paginii\n* așezarea în pagină\n* slider cu imagini creat de la 0, fără alte pachete terță\n* multe funcționalități oferite de NextJS.\nDatele prezente pe pagină sunt în mare parte introduse în mod dinamic, dintr-o bază de date non-relațională în format JSON, prin intermediul unui REST API.\nAplicația este Progressive Web App și poate fi instalată pe orice dispozitiv.\nÎn urma testării cu Lighthouse, scorul mediu a fost de 100 de puncte, atât pe desktop cât și pe mobil. Testarea a fost făcută prin intermediul Google Chrome, folosind o pagină incognito.\nTech stack: React, NextJS, NodeJS, MongoDB, SCSS."
  },
  {
    "title": "Animus",
    "image": "/images/projects/animus/og-image.png",
    "date": "Mai 2021",
    "link": "https://animus-lucian.herokuapp.com",
    "slug": "animus",
    "github": "https://github.com/lucianm05/Animus",
    "content": "Proiectul constă într-o platformă de e-commerce user friendly, cu design plăcut și responsive, ce permite utilizatorilor să își salveze adresele, să trimită comenzi, să își schimbe datele personale. Utilizatorii cu rol de administrator pot adăuga, modifica, șterge produse.\nPentru crearea acestui proiect am folosit resursele personale.\nTech stack: EJS, Sass, Bootstrap, JavaScript pentru Front-end, iar pentru Back-end Node.js Express.js, MySQL, Sequelize. În cadrul aplicației sunt incluse validări pentru informațiile introduse de utilizatori și protecție împotriva atacurilor de tip CSRF."
  },
  {
    "title": "Ghicește Culoarea",
    "image": "/images/projects/color-guess/og-image.png",
    "date": "Octombrie 2020",
    "link": "https://lucianm05.github.io/color-guess-game/",
    "slug": "color-guess",
    "github": "https://github.com/lucianm05/color-guess-game",
    "content": "Proiectul constă într-un joc în care un cod RGB împreună cu 6, 8 sau 10 card-uri (în funcție de dificultatea aleasă) cu diferite culori sunt generate întâmplător.\nJucătorul trebuie să ghicească culoarea cărui card se potrivește cu codul RGB generat.\nJucătorul dispune de 7, 6 sau 5 vieți (în funcție de dificultatea aleasă). De fiecare dată când este ales un card greșit, utilizatorul pierde o viață. Dacă este ales cel corect, jucătorul primește o viață. La 0 vieți rămase este declarat sfârșitul jocului.\nTech stack: HTML, CSS, JavaScript"
  },
  {
    "title": "X și 0",
    "image": "/images/projects/tictactoe/og-image.png",
    "date": "Octombrie 2020",
    "link": "https://lucianm05.github.io/tic-tac-toe/",
    "slug": "tic-tac-toe",
    "github": "https://github.com/lucianm05/tic-tac-toe",
    "content": "Aplicația constă într-un joc clasic de X și 0 în care calculatorul este oponentul.\nJucătorul poate alege dacă dorește să joace cu X sau cu 0. Acestuia îi revine întotdeauna prima mișcare.\nImediat după ce jucătorul face o mișcare, calculatorul își alege singur unde dorește să atace.\nTech stack: HTML, CSS, JavaScript"
  }
]
